Rapport/rapport.tex
% Created 2017-01-15 Sun 15:21
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[version=3]{mhchem}
\usepackage{minted}
\author{Willian Ver Valem Paiva \& Alan Guitard}
\date{\today}
\title{Hadoop k-means}
\hypersetup{
 pdfauthor={Willian Ver Valem Paiva \& Alan Guitard},
 pdftitle={Hadoop k-means},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.1.1 (Org mode 9.0.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Introduction}
\label{sec:org2c21b8d}

Ce projet est destiné à mettre en œuvre un programme en map/reduce pattern pour calculer le K-means
d'un ensemble de données à N dimensions en utilisant la récursivité pour construire un arbre hiérarchique.
Il a aussi pour objectif de réaliser un deuxième programme  map/reduce pattern qui étiquette les clusters
créés à chaque niveau de la hiérarchie. 


\section{Mise en oeuvre}
\label{sec:orga0824aa}

\subsection{Le K-means}
\label{sec:org3d8c243}

Le programme K-means travaille en exécutant les étapes suivantes :

\begin{enumerate}
\item Création d'un dossier temporaire d'input dans les hdfs
\item Copie du fichier input dans le premier niveau du dossier temporaire d'input
\item Création d'un dossier temporaire d'output dans les hdfs
\item Lancement d'un job pour tous les fichiers de chaque dossier d'un même niveau du dossier temporaire d'input en cours de traitement. Ce job fait deux choses:  
\begin{enumerate}
\item Il examine chaque fichier pour trouver le K-means
\item Une fois qu'il est trouvé, création d'un fichier pour chaque cluster, doté de son numéro de cluster mis à la fin de chaque ligne et transfert dans le dossier temporaire d'outputs
\end{enumerate}
\item Prise de l'output des K-means et copie dans le niveau suivant du dossier temporaire d'input
\item Une fois les K-means finis, concaténation des fichiers au dernier niveau du dossier temporaire d'input, et versement dans le fichier
d'output défini dans les paramètres.
\end{enumerate}


\subsubsection{Étapes 1 et 3}
\label{sec:org278f684}

Pour créer les dossiers, nous utilisons la méthode mkdirs de FileSystem:

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{java}
fs.mkdirs(new Path(TEMPIN+"/N1"));
\end{minted}

\subsubsection{Étape 2}
\label{sec:org4cebcfd}

Cette étape consiste à copier le fichier d'input dans le dossier temporaire d'input, à l'intérieur du sous-dossier N1 qui représente le 
niveau 1 de l'arbre hiérarchique, et pour cela, nous utilisons le simple code : 

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{java}
copyFile(args[0],TEMPIN+"/N1/1",fs,conf);
\end{minted}

  Cette partie en particulier contenait un problème dont nous ne nous sommes pas rendu compte avant la fin du projet. Car nous avons toujours
testé le programme avec le fichier \emph{worldcitiespop.txt} et ça n'avait jamais posé de problème ; mais une fois que le code a été testé avec 
le gros fichier 52Go du cluster de machines de l'Université, nous avons constaté que cette approche n'était vraiment pas la bonne. 
Et de ce fait, les performances de notre programme en ont souffert\ldots{} 

\subsubsection{Étape 4 et 5}
\label{sec:org6f965fa}
C'est là le coeur du programme ; à cette étape, nous lançons un K-means pour chaque fichier à l'intérieur d'un dossier du niveau
hiérarchique de l'arbre. Exemple : 

\begin{itemize}
\item à la racine l'arbre, nous lisons les fichiers à l'intérieur du dossier : 

\begin{verbatim}
/tempin/N1
\end{verbatim}

\item au niveau 2, nous lisons les fichiers à l'intérieur du dossier :

\begin{verbatim}
/tempin/N2
\end{verbatim}

\item etc\ldots{}, jusqu'à ce que nous atteignions le niveau donné par le paramètre.
\end{itemize}

Le K-means va copier l'output dans un fichier pour chaque cluster au niveau suivant de l'arbre hiérarchique. Exemple :

\begin{itemize}
\item Un K-means 2 au dossier racine donnera comme output :

\begin{verbatim}
/tempin/N2/1
/tempin/N2/2
\end{verbatim}

\item et un K-means 2 dans le dossier de niveau 2 donnera comme output :

\begin{verbatim}
/tempin/N3/1
/tempin/N3/2
/tempin/N3/3
/tempin/N3/4
\end{verbatim}

\item et ainsi de suite, jusqu'à atteindre le niveau donné dans le paramètre +1
\end{itemize}

\subsubsection{Étape 6}
\label{sec:org23c7f99}

A cette étape, nous concaténons tous les fichiers du dernier niveau du dossier d'input, pour constituer un fichier 
d'output (nommé comme le paramètre donné à l'exécution). Pour ce faire, nous utilisons une des premières leçons que nous
avons eu en programmation \emph{Hadoop}, en employant le code suivant : 

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{java}
Path outPut = new Path(args[1]);
OutputStream os = fs.create(outPut);
for(Path path:pths){
  FSDataInputStream is = fs.open(path);
  //copy the intout in to the output using the conf format
  IOUtils.copyBytes(is,os,conf,false);
  is.close();
}
\end{minted}

\subsection{Etiquettage}
\label{sec:org96d6485}

La partie "étiquettage" du projet a été réalisée en développant une classe appelée \emph{LabelKey} qui est \emph{writable} 
et \emph{comparable} et aussi en développant un \emph{partitioner} qui sépare les clés par le numéro de niveau de l'arbre.
Le \emph{LabelKey} prend simplement les colonnes de clusters et crée une chaîne en tant que clé. Exemple : 

\begin{verbatim}
text,0,1,2 --> key = "0,1,2"
\end{verbatim}

Dans ce cas, il créerait une taille qui représente le niveau ; dans cet exemple la clé serait de taille 3.

\subsubsection{Le \emph{mapper}}
\label{sec:org90eeb28}

le \emph{mapper} dans ce programme lit les lignes et pour chaque ligne, écrit dans le \emph{context} la 
[key, label, value] mais il fait ceci depuis le premier jusqu'au dernier niveau. 
\newpage
\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{java}
public void map(Object key, Text value, Context context
                ) throws IOException, InterruptedException {
  String[] values = value.toString().split(",");
  String sk = "";
  for(int x:labels){
  int l=0;
  try{
    l = Integer.parseInt(values[x].replaceAll("\\s+",""));
    }
    catch(NumbeFormatException e){ return; }
    
    if(sk.equals("")){
      sk += ""+l;
    }else{
      sk += ","+l;
    }
    if(values[measureCol].equals("")){
      values[measureCol] = "0";
    }
    context.write(new LabelKey(new Text(sk)),new Text(values[labelCol]+","+values[measureCol]));
  }

}
\end{minted}
et de cette façon, crée un fichier pour chaque niveau de l'arbre hiérarchique.


\subsubsection{Le \emph{reducer}}
\label{sec:org3396736}
Dans le \emph{reducer} nous prenons simplement la valeur la plus grande et utilisons son 
étiquette pour créer l'output : 

\begin{minted}[frame=lines,fontsize=\scriptsize,linenos]{java}
public void map(Object key, Text value, Context context
                ) throws IOException, InterruptedException {
  String[] values = value.toString().split(",");
  String sk = "";
  for(int x:labels){
    int l = Integer.parseInt(values[x].replaceAll("\\s+",""));
    if(sk.equals("")){
      sk += ""+l;
    }else{
      sk += ","+l;
    }
    if(values[measureCol].equals("")){
      values[measureCol] = "0";
    }
    context.write(new LabelKey(new Text(sk)),new Text(values[labelCol]+","+values[measureCol]));
  }

}
\end{minted}
\end{document}
